## Staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.budget_notifier.aws_cloudwatch_event_rule.daily_budget_spend has moved to module.budget_notifier.aws_cloudwatch_event_rule.daily_budget_spend[0]
    resource "aws_cloudwatch_event_rule" "daily_budget_spend" {
        id                  = "dailyBudgetSpend"
        name                = "dailyBudgetSpend"
        tags                = {
            "CostCentre" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_cloudwatch_event_rule.weekly_budget_spend has moved to module.budget_notifier.aws_cloudwatch_event_rule.weekly_budget_spend[0]
    resource "aws_cloudwatch_event_rule" "weekly_budget_spend" {
        id                  = "weeklyBudgetSpend"
        name                = "weeklyBudgetSpend"
        tags                = {
            "CostCentre" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_cloudwatch_event_target.daily_budget_spend has moved to module.budget_notifier.aws_cloudwatch_event_target.daily_budget_spend[0]
    resource "aws_cloudwatch_event_target" "daily_budget_spend" {
        id             = "dailyBudgetSpend-terraform-20240327132210976400000004"
        # (5 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_cloudwatch_event_target.weekly_budget_spend has moved to module.budget_notifier.aws_cloudwatch_event_target.weekly_budget_spend[0]
    resource "aws_cloudwatch_event_target" "weekly_budget_spend" {
        id             = "weeklyBudgetSpend-terraform-20240327132210976100000003"
        # (5 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_lambda_function.spend_notifier will be updated in-place
  ~ resource "aws_lambda_function" "spend_notifier" {
        id                             = "spend_notifier"
      ~ last_modified                  = "2024-03-27T13:22:11.207+0000" -> (known after apply)
      ~ runtime                        = "nodejs16.x" -> "nodejs20.x"
      ~ source_code_hash               = "KqgaQgrKH72tPtzVxEXFeT0UIdVJmB8W7Q3/O5onycQ=" -> "1vH83BDA1sIoBtTcwyvC2n+w932l6mJkelGZEWjy0pU="
        tags                           = {
            "CostCentre" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.budget_notifier.aws_lambda_permission.allow_daily_budget has moved to module.budget_notifier.aws_lambda_permission.allow_daily_budget[0]
    resource "aws_lambda_permission" "allow_daily_budget" {
        id            = "AllowDailyBudget"
        # (5 unchanged attributes hidden)
    }

  # module.budget_notifier.aws_lambda_permission.allow_weekly_budget has moved to module.budget_notifier.aws_lambda_permission.allow_weekly_budget[0]
    resource "aws_lambda_permission" "allow_weekly_budget" {
        id            = "AllowWeeklyBudget"
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_critical.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/18468d9b9b27e11ad9afde31a6a9771f5e726075d8792ba12d455202868bcc35.zip" -> "builds/1e622be40890679d302c03a6096c334d64151aab5aee3e073035598ee5e01db2.zip"
        id                             = "notify-slack-critical"
      ~ last_modified                  = "2023-10-17T15:16:39.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical:9" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical:9/invocations" -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.11"
        tags                           = {}
      ~ version                        = "9" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_critical.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "AllowExecutionFromSNS" -> (known after apply)
      ~ qualifier           = "9" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_critical.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + ".terraform/modules/notify_slack_critical/functions/notify_slack.py",
                      + null,
                    ],
                ]
              + filename      = "builds/1e622be40890679d302c03a6096c334d64151aab5aee3e073035598ee5e01db2.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/1e622be40890679d302c03a6096c334d64151aab5aee3e073035598ee5e01db2.plan.json"
      + id                   = (known after apply)
    }

  # module.notify_slack_critical.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2491829971522086453" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/18468d9b9b27e11ad9afde31a6a9771f5e726075d8792ba12d455202868bcc35.zip" -> "builds/1e622be40890679d302c03a6096c334d64151aab5aee3e073035598ee5e01db2.zip"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_general.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/e8b93d66dbf2c7ef2479acf0c5f9890c23c1fcd432e81da57f3f5b5ec1061753.zip" -> "builds/2c26292ef7673e1f67a17eeecb7e7e2729a987663fdec0eb8f3028fce40d5ab4.zip"
        id                             = "notify-slack-general"
      ~ last_modified                  = "2023-10-17T15:19:25.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-general:7" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-general:7/invocations" -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.11"
        tags                           = {}
      ~ version                        = "7" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_general.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "AllowExecutionFromSNS" -> (known after apply)
      ~ qualifier           = "7" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_general.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + ".terraform/modules/notify_slack_general/functions/notify_slack.py",
                      + null,
                    ],
                ]
              + filename      = "builds/2c26292ef7673e1f67a17eeecb7e7e2729a987663fdec0eb8f3028fce40d5ab4.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/2c26292ef7673e1f67a17eeecb7e7e2729a987663fdec0eb8f3028fce40d5ab4.plan.json"
      + id                   = (known after apply)
    }

  # module.notify_slack_general.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "9152839017737369376" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/e8b93d66dbf2c7ef2479acf0c5f9890c23c1fcd432e81da57f3f5b5ec1061753.zip" -> "builds/2c26292ef7673e1f67a17eeecb7e7e2729a987663fdec0eb8f3028fce40d5ab4.zip"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/7877f6dfc99e932437e08c1de7ba322bc1d72a6f3fe5b5c5e8b6eacee4f239eb.zip" -> "builds/c0bc8d02f0098b178b87a31e448515f17dfa6165f117bbeca9526aa66b9266f3.zip"
        id                             = "notify-slack-ok"
      ~ last_modified                  = "2023-10-17T15:19:36.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok:3/invocations" -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.11"
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "AllowExecutionFromSNS" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_ok.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + ".terraform/modules/notify_slack_ok/functions/notify_slack.py",
                      + null,
                    ],
                ]
              + filename      = "builds/c0bc8d02f0098b178b87a31e448515f17dfa6165f117bbeca9526aa66b9266f3.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/c0bc8d02f0098b178b87a31e448515f17dfa6165f117bbeca9526aa66b9266f3.plan.json"
      + id                   = (known after apply)
    }

  # module.notify_slack_ok.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7235087564732725810" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/7877f6dfc99e932437e08c1de7ba322bc1d72a6f3fe5b5c5e8b6eacee4f239eb.zip" -> "builds/c0bc8d02f0098b178b87a31e448515f17dfa6165f117bbeca9526aa66b9266f3.zip"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/b02ab3a0ae7399c2cfa86e739b9fa00da6ec254197e68e97db7a6f04baae10d0.zip" -> "builds/19863096150fa1a6df6f86bf4faddd68a0875c2a3c199bd42c44f533dcd009d3.zip"
        id                             = "notify-slack-warning"
      ~ last_modified                  = "2023-10-17T15:19:31.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning:9" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning:9/invocations" -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.11"
        tags                           = {}
      ~ version                        = "9" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "AllowExecutionFromSNS" -> (known after apply)
      ~ qualifier           = "9" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_warning.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + ".terraform/modules/notify_slack_warning/functions/notify_slack.py",
                      + null,
                    ],
                ]
              + filename      = "builds/19863096150fa1a6df6f86bf4faddd68a0875c2a3c199bd42c44f533dcd009d3.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/19863096150fa1a6df6f86bf4faddd68a0875c2a3c199bd42c44f533dcd009d3.plan.json"
      + id                   = (known after apply)
    }

  # module.notify_slack_warning.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4481870494764080287" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b02ab3a0ae7399c2cfa86e739b9fa00da6ec254197e68e97db7a6f04baae10d0.zip" -> "builds/19863096150fa1a6df6f86bf4faddd68a0875c2a3c199bd42c44f533dcd009d3.zip"
            # (1 unchanged element hidden)
        }
    }

Plan: 12 to add, 5 to change, 8 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 65 more similar warnings elsewhere)
time=2024-05-09T14:21:44Z level=info msg=Executing hook: get-admin prefix=[/home/runner/work/notification-terraform/notification-terraform/env/staging/common] 
Cloning into '/var/tmp/notification-admin'...

Error: versioning_configuration.status cannot be updated from 'Enabled' to 'Disabled'

  with module.athena_logs_bucket.aws_s3_bucket_versioning.this,
  on .terraform/modules/athena_logs_bucket/S3_log_bucket/main.tf line 205, in resource "aws_s3_bucket_versioning" "this":
 205: resource "aws_s3_bucket_versioning" "this" {


Error: versioning_configuration.status cannot be updated from 'Enabled' to 'Disabled'

  with module.csv_bucket_logs.aws_s3_bucket_versioning.this,
  on .terraform/modules/csv_bucket_logs/S3_log_bucket/main.tf line 205, in resource "aws_s3_bucket_versioning" "this":
 205: resource "aws_s3_bucket_versioning" "this" {


Error: versioning_configuration.status cannot be updated from 'Enabled' to 'Disabled'

  with module.document_download_logs.aws_s3_bucket_versioning.this,
  on .terraform/modules/document_download_logs/S3_log_bucket/main.tf line 205, in resource "aws_s3_bucket_versioning" "this":
 205: resource "aws_s3_bucket_versioning" "this" {

time=2024-05-09T14:22:06Z level=error msg=Terraform invocation failed in /home/runner/work/notification-terraform/notification-terraform/env/staging/common/.terragrunt-cache/vSsGrkoVpAumzVObg4Ds4hDC_7Y/ziUKr5pa_JoeDZ3wgSbieuIpHJE/common prefix=[/home/runner/work/notification-terraform/notification-terraform/env/staging/common] 
time=2024-05-09T14:22:06Z level=info msg=Executing hook: cleanup-admin prefix=[/home/runner/work/notification-terraform/notification-terraform/env/staging/common] 
time=2024-05-09T14:22:06Z level=error msg=1 error occurred:
	* exit status 1



```

</details>

